In [1]:
import pandas as pd

In [15]:
df=pd.read_csv('Resources/SF_Fires.csv')
df.head()

   year               coordinates
0  2015   (-122.422595 37.778775)
1  2015   (-122.411293 37.785387)
2  2015   (-122.435771 37.762457)
3  2015   (-122.407004 37.770049)
4  2015   (-122.413057 37.777636)

In [16]:
df=df.dropna()

In [17]:
df['year']=df['year'].astype('str')

In [18]:
for idx, row in df.iterrows(): 
    row['coordinates']=row['coordinates'].replace(' (', '').replace(')', '')
    lon, lat=row['coordinates'].split(' ')
    df.loc[idx, 'lat']=lat
    df.loc[idx, 'lon']=lon

In [9]:
df.head()

   year               coordinates        lat          lon
0  2015   (-122.422595 37.778775)  37.778775  -122.422595
1  2015   (-122.411293 37.785387)  37.785387  -122.411293
2  2015   (-122.435771 37.762457)  37.762457  -122.435771
3  2015   (-122.407004 37.770049)  37.770049  -122.407004
4  2015   (-122.413057 37.777636)  37.777636  -122.413057

In [19]:
df[df['year']=='2019']

        year            coordinates        lat          lon
128952  2019  -122.413355 37.788082  37.788082  -122.413355
128953  2019  -122.411992 37.785035  37.785035  -122.411992
128954  2019   -122.46785 37.782859  37.782859   -122.46785
128955  2019  -122.403637 37.788256  37.788256  -122.403637
128957  2019   -122.41409 37.784771  37.784771   -122.41409
...      ...                    ...        ...          ...
162204  2019    -122.4443 37.799124  37.799124    -122.4443
162205  2019   -122.398453 37.79147   37.79147  -122.398453
162206  2019  -122.388204 37.741891  37.741891  -122.388204
162207  2019  -122.398697 37.741126  37.741126  -122.398697
162208  2019  -122.502589 37.779452  37.779452  -122.502589

[33235 rows x 4 columns]

In [20]:
df.groupby('year').size()

year
2015    31702
2016    32229
2017    32303
2018    32663
2019    33235
2020    29835
2021    31235
2022    33782
2023     8035
dtype: int64

In [21]:
df.to_csv('Resources/clean_data.csv', index=False)